---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.IncludeAdditionalLoad
source: html/11a9318d-aff9-fbe6-e5e1-a588c8ca3573.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.IncludeAdditionalLoad Property

Should the additional load (if set) be included in demand load calculations.

## Syntax (C#)
```csharp
public bool IncludeAdditionalLoad { get; set; }
```